
codes = {
    # 文章
    # 增
    10001: {"code": 10001, "msg": "添加成功"},
    10002: {"code": 10002, "msg": "添加失败"},
    # 查
    10003: {"code": 10003, "msg": "查询成功"},
    10004: {"code": 10004, "msg": "查询失败"},
    # 改
    10005: {"code": 10005, "msg": "更新成功"},
    10006: {"code": 10006, "msg": "更新失败"},
    # 删
    10007: {"code": 10007, "msg": "删除成功"},
    10008: {"code": 10008, "msg": "删除失败"},
    
    # 通用
    12001: {"code": 12001, "msg": "请用POST请求"},
    12002: {"code": 12002, "msg": "请用GET请求"},
    12003: {"code": 12003, "msg": "缺少数据"}
}



def GetCode(code):
    return codes[code]